/*Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N*/

/*int Sum(int m, int n)
{
    if(n < m)
    {
        if(m > n) return Sum(m - 1, n) + m;
        else return m;
    }
    else
    {        
        if(n > m) return Sum(m, n - 1) + n;
        else return n;
    }
}
Console.Write("Введите первое число: ");
int onenumber = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
int twonumber = Convert.ToInt32(Console.ReadLine());
Console.WriteLine();
if(onenumber < twonumber) 
    Console.WriteLine($"Сумма натуральных элементов от {onenumber} до {twonumber} равна {Sum(onenumber, twonumber)}");
else
    Console.WriteLine($"Сумма натуральных элементов от {onenumber} до {twonumber} равна {Sum(onenumber, twonumber)}");*/
