/*Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.*/

/*void Pali (int number)
{
    int revers = 0;
    int num = number;
    int ber = 0;
    while (number > 0)
     {
        ber = number % 10;
        number = number / 10;
        revers = revers * 10;
        revers = revers + ber;
     }
    if (num == revers) 
    Console.WriteLine ($"Это число палиндром");
    else
    Console.WriteLine($"Это число не палиндром");
}
Console.WriteLine ("Введите число ");
int drom = Convert.ToInt32(Console.ReadLine());
Pali (drom);*/
